{"hed":"The Hype Ain’t Right","dek":"Every year the top high school basketball recruits get hyped up. How often do they pan out?","title":"The Next Michael Jordan","date":"Feb 2019","author1":"Russell Goldenberg","author1URL":"https://pudding.cool/author/russell-goldenberg/","author2":"Amber Thomas","author2URL":"https://pudding.cool/author/amber-thomas/","intro":[{"type":"text","value":"Remember NBA great Donnell Harvey? Neither do we. Despite being the #1 high school recruit in 2000&mdash;something that you think would indicate future NBA stardom&mdash;he put together a meager career in the league, averaging around 5 points per game over 5 years. On the flip side is LeBron James&mdash;the #1 high school recruit just a few years later&mdash;and we all know what he’s been up to."},{"type":"text","value":"This disparity got us thinking, <strong>are these top 100 recruit lists any indication of making it to the NBA, let alone becoming a star?</strong>"},{"type":"text","value":"It must be really hard to assess top talent when the pool is so large in high school. Now that we’ve entered the YouTube era, hype surrounding players can inflate in an instant. Sure, LeBron paved the way with some nationally televised games, but now millions of people are watching <span data-side=left>Zion Williamson</span> throw down dunks in warm ups, or <span data-side=right>Lamelo Ball</span> hit threes from half court in eight grade."},{"type":"text","value":"Let’s take a look at just how far the high school stars of the past 20 years made it in their basketball careers."},{"type":"text","value":"Below, each circle is a player that ranked amongst the top 100 high school recruits in the US according to the Recruiting Services Consensus Index."}],"rankTitle":"Level Reached of <span class=top>Top 100</span> High School Players","rankSub":"Percentage of players that reach each level (out of 1,563 players) from 1998 - 2013","top10":[{"type":"text","value":"27% of the 1,563 top-ranked high school players made it to the NBA and only 25% made it past their two-year rookie contract. Put another way, 441 of the 900 draft picks in that 15 year span were top 100 recruits. Just 11 players eventually reached an average VORP (Value Over Replacement Player) ranking in the top 20, claiming “superstar” status."},{"type":"text","value":"But perhaps the top 100 is too broad of a categorization. Surely the top 10 players will make it to the NBA more often, right?"}],"top10Title":"Level Reached of <span class=top>Top 10</span> High School Players","top10Sub":"Percentage of players that reach each level (out of 158 players) from 1998 - 2013","postTop10":[{"type":"text","value":"Players ranked in the top 10 certainly appear to have slightly better odds&mdash;a full 84% of them eventually made it to the NBA. Though with 60 draft picks a year, you might expect that number to be higher."},{"type":"text","value":"In the late 1990’s and early 2000’s, teams could bet hard enough on a player’s future success that they could draft them straight out of high school. This ended in 2006 when a <a href=https://web.archive.org/web/20080227065646/http://www.nbpa.com/cba_articles/article-X.php target=_blank>rule</a> was <a href=https://www.nytimes.com/2005/06/28/sports/basketball/nba-draft-will-close-book-on-high-school-stars.html target=_blank>put into place</a>, declaring that players had to be at least 19 years old or one year removed from high school before getting drafted. But talks are escalating about <a href=http://www.espn.com/nba/story/_/id/26049542/nba-proposes-changing-draft-age-19-18-players-union target=_blank>reversing this rule</a>, especially in light of the <a href=https://www.youtube.com/watch?v=LqJUgQAyDMo target=_blank>“shoe incident”</a>. Let’s look at the success of the straight-to-NBA high school players."}],"skipTitle":"Level Reached of <span class=top>Straight-to-NBA</span> HS Players","skipSub":"Percentage of players that reach each level (out of 35 players) from 1998 - 2005","postSkip":[{"type":"text","value":"Opponents of removing the age limit often cite players like Korleone Young as reasons to keep it in place. Young, the #3 ranked high school player in 1998, ultimately fizzled out of the NBA having played only <a href=http://www.basketball-reference.com/players/y/youngko01.html target=_blank>15 minutes</a> across 3 games. However, he appears to be the exception more than the rule. Of the other 34 players drafted straight out of high school, 94% made it past their rookie contract, with 7% eventually becoming mediocre or better NBA players."},{"type":"text","value":"Let’s switch our view once more, away from the highest ranking high school players to those that played in a US high school, but did not appear on the top 100 list. We found 338 of these players that were eventually drafted into the NBA, despite being undervalued in high school. Let’s compare their career paths with our highly-ranked and drafted high schoolers."}],"allTitle":"Level Reached of Drafted <span class=top>Top</span> & <span class=unranked>Unranked</span> HS Players","allSub":"Percentage of players that reach each level (out of 779 players) from 1998 - 2013","postAll":[{"type":"text","value":"Even when we limit the top ranked players to just those that were eventually drafted, the success rate of players ranked in high school is notably higher than for those who weren’t. Where 92% of the drafted and ranked players made it past their rookie contract, only 73% of the unranked and drafted players stayed more than two years. Three players&mdash;Russell Westbrook, Stephen Curry and Damian Lillard&mdash;whose high school careers were apparently not worthy of a spot amongst the top 100, still broke into the ranks of superstars in their NBA careers."},{"type":"text","value":"Let’s look at one more slice that has lofty expectations; The Big 4. Kentucky, Kansas, Duke, and UNC are known to consistently land the biggest recruits. Do these recruits translate into NBA success stories or is college their last stop?"}],"big4Title":"Level Reached of Players from <span class=top>Kentucky, Kansas, Duke, and UNC</span>","big4Sub":"Percentage of players that reach each level (out of 157 players) from 1998 - 2013","smallMult":[{"type":"text","value":"The college funnel is an interesting discussion, especially when the discussion surrounds the lack of pay for NCAA student athletes. Below we widen the field to take a look at the biggest NBA-producing colleges and see how many yield NBA talent."}],"postKey":[{"type":"text","value":"This text goes after the funnel key, but before the rest of the funnels"}],"method":"High school ranking data is based on the Recruiting Services Consensus Index (RSCI) rankings."}