{"title":"The Hype ain’t Right","dek":"also something about bball","date":"February 2019","intro":[{"type":"text","value":"Remember that NBA great Donnell Harvey? Neither do we. Despite being the number one high school recruit in 2000-something that you think would indicate future NBA prowess-he put together a meager career average just over 5 points per game over 5 years. On the flip side is LeBron James-also the number one high school player in 2003- now the *greatest NBA player of all-time."},{"type":"text","value":"So this begs the question, do we really know in high school how these players will turn out, or is it all just hype?"},{"type":"text","value":"Hype is even more inflated in the YouTube era. Sure LeBron had some games televised in high school, but now millions of people are watching Zion throw down dunk after monstrous dunk, or Lamelo Ball hit threes from half court in eight grade."},{"type":"text","value":"Let’s take look at the path players take from high school to the NBA to see what really happens."}],"rankTitle":"Maximum Level Reached of <span class=top>Top 100</span> High School Players","rankSub":"Percentage of players that reach each level (out of 1,563 players) from 1998 - 2013","top10Title":"Maximum Level Reached of <span class=top>Top 10</span> High School Players","top10Sub":"Percentage of players that reach each level (out of 158 players) from 1998 - 2013","allTitle":"Maximum Level Reached of <span class=top>Top</span> & <span class=unranked>Unranked</span> HS Players","allSub":"Percentage of players that reach each level (out of 1,901 players) from 1998 - 2013","uncTitle":"Maximum Level Reached of Players from U of North Carolina","uncSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","ukTitle":"Maximum Level Reached of Players from U of Kentucky","ukSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","dukeTitle":"Maximum Level Reached of Players from Duke U","dukeSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","kansasTitle":"Maximum Level Reached of Players from U of Kansas","kansasSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013"}