{"title":"The Hype Ain’t Right","dek":"The top high school basketball players get lots of hype about being the next big thing. But how often does that work out?","date":"Feb 2019","author1":"Russell Goldenberg","author1URL":"https://pudding.cool/author/russell-goldenberg/","author2":"Amber Thomas","author2URL":"https://pudding.cool/author/amber-thomas/","intro":[{"type":"text","value":"Remember that NBA great Donnell Harvey? Neither do we. Despite being the number one high school recruit in 2000&mdash;something that you think would indicate future NBA prowess&mdash;he put together a meager career average around 5 points per game over 5 years. On the flip side is LeBron James&mdash;the number one high school player just a few years later&mdash;now the *greatest NBA player of all-time."},{"type":"text","value":"So this begs the question, <strong>do we really know in high school how these players will turn out, or is it all just hype?</strong>"},{"type":"text","value":"Hype is even more inflated in the YouTube era. Sure LeBron had some games televised in high school, but now millions of people are watching Zion throw down dunk after monstrous dunk, or Lamelo Ball hit threes from half court in eight grade."},{"type":"text","value":"Let’s take a look at just how far the high school stars of the past 20 years made it in their basketball careers."},{"type":"text","value":"Below, each circle represents a single player that ranked amongst the Top 100 high school players in the US."}],"rankTitle":"Maximum Level Reached of <span class=top>Top 100</span> High School Players","rankSub":"Percentage of players that reach each level (out of 1,563 players) from 1998 - 2013","top10":"Looks like only about 28% of the 1,563 top ranked high school players made it to the NBA and only 17% made it past their two-year rookie contract. A slim 3 players&mdash;LeBron James, Chris Paul, and James Harden&mdash;eventually reached an average vorp score of 2 or higher, claiming “AllStar” status. But perhaps the top 100 is too broad of a categorization. Surely the top 10 players will make it to the NBA more often, right?","top10Title":"Maximum Level Reached of <span class=top>Top 10</span> High School Players","top10Sub":"Percentage of players that reach each level (out of 158 players) from 1998 - 2013","postTop10":"Players ranked in the top 10 certainly appear to have slightly better odds&mdash;a full 84% of them were eventually drafted to the NBA. In the late 90’s and early 2000’s, teams could bet hard enough on a player’s future success that they could draft them straight out of high school. This ended in 2006 when <a href=https://web.archive.org/web/20080227065646/http://www.nbpa.com/cba_articles/article-X.php target=_blank>rule</a> was put into place, declaring that players had to be at least 19 years old or one year removed from high school before getting drafted. But since there are talks about <a href=http://www.nba.com/article/2018/07/10/adam-silver-board-governors-draft-eligibility-age target=_blank>reversing this rule</a> as early as 2021, let’s look at the success of the straight-to-NBA high school players.","skipTitle":"Maximum Level Reached of <span class=top>Straight-to-NBA</span> HS Players","skipSub":"Percentage of players that reach each level (out of 35 players) from 1998 - 2005","allTitle":"Maximum Level Reached of <span class=top>Top</span> & <span class=unranked>Unranked</span> HS Players","allSub":"Percentage of players that reach each level (out of 1,901 players) from 1998 - 2013","uncTitle":"Maximum Level Reached of Players from U of North Carolina","uncSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","ukTitle":"Maximum Level Reached of Players from U of Kentucky","ukSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","dukeTitle":"Maximum Level Reached of Players from Duke U","dukeSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013","kansasTitle":"Maximum Level Reached of Players from U of Kansas","kansasSub":"Percentage of players that reach each level (out of 37 players) from 1998 - 2013"}